# FabricationTopOfPart Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationTopOfPart Property
ParameterTypeId Class See Also
---
"Upper End Top of Insulation Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationTopOfPart { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationTopOfPart As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationTopOfPart {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace